package session2;

/**
 * Написать класс для вычисления частоты слов в тексте с методами:
 - String setTextFromConsole()
 - String setTextFromFile(String fileName)
 - String generateRandomText(int textLength)
 - Set<String> getWordsByFrequency(int frequency)
 - Set<String> getWordsByFrequencyLessThan(int frequency)
 - Set<String> getWordsByFrequencyMoreThan(int frequency)
 - void printAcs() - вывести все слова + частота по возрастанию частоты
 - void printDesc() - вывести все слова + частота по убыванию частоты

 Класс задания hw2.frequency.Freq
 */
public class Frequency {
    public static void main(String[] args) {
        String[] base = {"Крики", "слезы", "туман",
                "Боль", "обида", "обман",
                "Тучи", "гром" ,  "ложь", "вокруг",
                "опять", "предатель", "друг",
                "Серость", "падаль", "беда",
                "Грех", "печаль",  "жизнь", "игра",
                "Зависть", "ужас", "плач",  "страх",
                "Осень", "стон", "крик", "и", "прах",
                "Жадность", "тоска", "ужас", "и", "горе",
                "Смерть", "холодное", "море",
                "Трясина", "отчаянье", "блеф",
                "Болезнь", "порок", "и", "гнев",
                "Любовь", "удача", "чистота",
                "Весна", "полет", "и", "свет", "всегда",
                "Жизнь", "тепло", "в", "небе", "луна",
                "Путь", "надежда", "доброта",
                "Рассвет", "сияние", "сила",
                "Крылья", "и", "свет", "мира",
                "Ясность", "надежда", "звезда",
                "Солнце", "земля", "небеса",
                "Ангел", "радость", "и", "душа",
                "Смех", "и", "правда", "чудеса",
                "Мама", "счастье", "и", "семья",
                "Жизнь", "гармония", "всегда"};
               //String[] isbnParts = base.split("-");
    }
}
